package com.hecaibao88.dirtygame.bean;

import java.util.List;

/**
 * @author WangGuoWei
 * @time 2017/12/25 15:19
 * @des ${TODO}
 * <p>
 * ┽
 * ┽                            _ooOoo_
 * ┽                           o8888888o
 * ┽                           88" . "88
 * ┽                           (| -_- |)
 * ┽                           O\  =  /O
 * ┽                        ____/`---'\____
 * ┽                      .'  \\|     |//  `.
 * ┽                     /  \\|||  :  |||//  \
 * ┽                    /  _||||| -:- |||||-  \
 * ┽                    |   | \\\  -  /// |   |
 * ┽                    | \_|  ''\---/''  |   |
 * ┽                    \  .-\__  `-`  ___/-. /
 * ┽                  ___`. .'  /--.--\  `. . __
 * ┽               ."" '<  `.___\_<|>_/___.'  >'"".
 * ┽              | | :  `- \`.;`\ _ /`;.`/ - ` : | |
 * ┽              \  \ `-.   \_ __\ /__ _/   .-` /  /
 * ┽         ======`-.____`-.___\_____/___.-`____.-'======
 * ┽                            `=---='
 * ┽         ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
 * ┽                      佛祖保佑       永无BUG
 * ┽
 * ┽
 * ┽
 * @updateAuthor $Author$
 * @updateDate $Date$
 * @updateDes ${TODO}
 */
public class cfData {

    /**
     * status : 10000
     * data : [["男伴双手抱住女伴的腰部，嘴里叼着一小块水果，两个人用30秒的时间吃完。",
     * "女伴用一只手抱住男伴的腰部，另外一只手用滑动的方式从胸部一直滑到胯部。时间不能少于30秒。","两个人每人各自喝一瓶酒。左右各选四个人友情赞助同样喝一瓶酒。"],
     * ["男伴在女伴屁股上左边打三下右边打三下。然后问问女伴爽不爽。不爽继续打，直到女伴说爽为止。",
     * "女伴用嘴咬住男伴胯下的裤子，咬住松开，咬住松开，反复10次。问问男伴爽不爽，不爽继续咬。直到男伴说爽为止。",
     * "双方各自拿起一瓶酒，各自喝酒半瓶，然后交换，最后全部喝完。说出酒的味道。"],["男伴躺在沙发上，女伴趴在男伴身上，做十组划船的动作，十组游泳的动作。",
     * "女伴头朝下跪在沙发上，男伴站在女伴后面，双手抓住女伴的衣服，做前后方向的摇摆动作20次。女伴假装牙疼叫喊。","女伴用嘴喝一口酒，喂给到男伴的嘴里。直到一瓶酒喝完为止。"],
     * ["女伴大腿中间夹一个杯子，男伴大腿夹住一个酒瓶，把 瓶子放在杯子里，做20次活塞运动，每次运动，女伴需要配合牙疼叫喊。",
     * "男伴闭上眼睛，女伴把自己的胸部放在男伴的鼻子下面，男伴通过鼻子触碰与嗅觉辨别是左边还是右边。","女伴指定周边男玩伴帮你喝酒一杯。不喝酒就喊三声：我是大王八。"],
     * ["男女面对面，女伴用手拉住男生脖子，腿部夹住男生腰部，男伴双手托住,女伴屁股，装瘸子，围绕场地走10步。","男女面对面站立，相互抱住腰，用嘴把一张面巾纸撕咬成十份以上。",
     * "男女各自喝酒一杯。女生的酒可以让男生帮着喝完。男生可以免喝酒，需要需要购买下一轮游戏包。购买后，所有人举杯喝酒感谢土豪赏赐。"],
     * ["男伴用手摸的方式，摸30秒时间，猜出女生穿的是什么样式的内裤。是丁字裤？是三角裤？还,是没穿？",
     * "女伴用手摸的方式，摸30秒时间，猜出男生蛋蛋的大小。是鸽子蛋？乒乓球？还是鸡蛋？","男伴女伴各自喝酒一瓶。不喝就学猫叫10声。"],
     * ["女伴用嘴叼起一个块儿水果，喂给男生，男生每次只吃一点点，分成10次吃完。","男伴把双手放在女生的屁股上按10次，告诉大家，这个女生哪半边屁股的弹性最好。",
     * "男女双方互换酒杯，一边喝酒一边倒酒。直到喝完一瓶为止。"],["女伴骑在男伴身上，屁股离开身体一厘米高，再坐回去，反复10次。",
     * "男伴蹲在地上，转五圈，然后用鼻子顶住女伴到屁股，通过嗅觉告诉大家这个女伴香不香。","男伴是土豪，购买下一轮游戏包。购买后，所有人举杯感谢土豪赏赐。女伴主动献上香吻一个。"],
     * ["一根牙签两人咬着不能掉，男女两个人相互叼着围绕场地向前10步走，再向后10步走,。","女伴平躺在地上，男生趴在女生身上，两个人用嘴吃一块儿水果。分成5次吃完。",
     * "男伴独立喝酒一瓶，不喝酒要说我是乌龟王八蛋三次。"],["女伴把男生裤子脱下来，在男生屁股上亲三次，然后帮男生再穿上裤子。",
     * "男伴用手测量女伴从脚到大腿根部的距离，告诉大家女伴是不是长腿美女。","女伴独立喝酒一瓶，不喝酒要说：老娘还是处女。欢迎来搞，说三次。"],
     * ["女伴用脚勾住男伴脖子，男伴双手拉住女伴的手，围绕场地前进走10步，后退走10步。","男伴用手握住女伴咪咪，每间隔2秒按一次，上下按十次，告诉大家女伴的咪咪有多大。",
     * "男伴是土豪，购买下一轮游戏包。购买后，所有人举杯感谢土豪赏赐。女伴主动献上香吻一个。"],["男伴是钢管，女伴围着钢管跳一分钟性感舞蹈。",
     * "男伴用双手按住女伴的右脚，挠脚心10次。每次时间是3秒。","两个人喝交杯酒一瓶。周边所有人友情赞助一杯。"],["女伴拿着一杯酒，摸着男伴的裤裆把酒喝完。",
     * "男伴拿着一杯酒，摸着女伴的胸部把酒喝完。","在10秒时间内，男女各自喝酒一瓶。"],
     * ["女伴双手放在腿上，崛起屁股，男生在后面顶住女伴，在中间放一张面巾纸，前进走10步，后退走10步，保证面巾纸不能掉下来。如果面巾纸掉下来，男伴购买下一轮游戏包。",
     * "两个人相互拥抱，头部之间保持20厘米距离。在二人胯部放一张面巾纸，向前10步走，在向后10步走，保证面巾纸不能掉在地上，如果掉在地上，男伴购买下一轮游戏包。",
     * "男女各自喝酒3瓶。不能找人替喝，如果找人替喝，必须要购买下一轮游戏包。购买游戏包以后，所人举杯感谢土豪赏赐，女伴主动献上香吻一个。"],
     * ["女伴想办法在20秒内让男伴小鸡鸡增长一厘米。如果不增长，男伴购买下一轮游戏包。","男伴把手放在女伴的腿部内侧，从膝盖向上滑动20次。然后用手测量女伴大腿的长度。",
     * "女伴可以陪着男伴各自喝酒一瓶。周边所有人友情赞助一杯。"],["男伴从后面用双手捂住女伴胸部，上下拂动10次。然后告诉大家有没有弹性。",
     * "女伴用大腿根部夹住一张面巾纸，男伴用嘴咬住面巾纸，前进10步，后退10步。","相互拥抱，各自喝酒一瓶，周边所有人友情赞助一杯。"]]
     */

    private int status;
    private List<List<String>> data;

    public int getStatus() {
        return status;
    }

    public void setStatus(int status) {
        this.status = status;
    }

    public List<List<String>> getData() {
        return data;
    }

    public void setData(List<List<String>> data) {
        this.data = data;
    }
}
